       IDENTIFICATION DIVISION.
       PROGRAM-ID. PremiumCalculation.

       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-PRICE PIC 9(6).
       01 LK-PERIOD-FACTOR PIC 9V99.
       01 LK-BASE-RATE PIC 9V99.
       01 LK-PREMIUM PIC 9(9)V99.


       PROCEDURE DIVISION USING LK-PRICE, LK-PERIOD-FACTOR,
       LK-BASE-RATE, LK-PREMIUM.

       COMPUTE LK-PREMIUM = LK-PRICE * LK-BASE-RATE
      * LK-PERIOD-FACTOR.

       EXIT PROGRAM.

       END PROGRAM PremiumCalculation.
